Revit 2026 API

# CurveLoopsProfile Class

---

Represents a curve loop based profile for sweep or swept blend elements.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBSweepProfile Autodesk.Revit.DBCurveLoopsProfile

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CurveLoopsProfile : SweepProfile
```
```vb
Public Class CurveLoopsProfile
	Inherits SweepProfile
```
```cpp
public ref class CurveLoopsProfile : public SweepProfile
```
```fsharp
type CurveLoopsProfile =
    class
        inherit SweepProfile
    end
```

The CurveLoopsProfile type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Profile | Returns the curve loops of the profile. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Use objects of this type in methods as NewSweep() and NewSweptBlend() in FamilyItemFactory to create the profile.

#### Reference

Autodesk.Revit.DB Namespace